RT-Thread/rt-thread/bsp/imxrt/imxrt1060-nxp-evk/board/board.c
    /* Enable I cache and D cache */
    SCB_EnableDCache();
    SCB_EnableICache();
}

/* This is the timer interrupt service routine. */
void SysTick_Handler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    rt_tick_increase();

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_USING_DMA
void imxrt_dma_init(void)
{
    edma_config_t config;

    DMAMUX_Init(DMAMUX);
    EDMA_GetDefaultConfig(&config);
    EDMA_Init(DMA0, &config);
}
#endif

#ifdef BSP_USING_LPUART
void imxrt_uart_pins_init(void)
{
#ifdef BSP_USING_LPUART1

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_12_LPUART1_TX, /* GPIO_AD_B0_12 is configured as LPUART1_TX */
        0U);                             /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_13_LPUART1_RX, /* GPIO_AD_B0_13 is configured as LPUART1_RX */
        0U);                             /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_12_LPUART1_TX, /* GPIO_AD_B0_12 PAD functional properties : */
        0x10B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: medium(100MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_13_LPUART1_RX, /* GPIO_AD_B0_13 PAD functional properties : */
        0x10B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                     Drive Strength Field: R0/6
                                                     Speed Field: medium(100MHz)
                                                     Open Drain Enable Field: Open Drain Disabled
                                                     Pull / Keep Enable Field: Pull/Keeper Enabled
                                                     Pull / Keep Select Field: Keeper
                                                     Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                     Hyst. Enable Field: Hysteresis Disabled */
#endif
#ifdef BSP_USING_LPUART2

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_02_LPUART2_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_03_LPUART2_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_02_LPUART2_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_03_LPUART2_RX,
        0x10B0u);

#endif
#ifdef BSP_USING_LPUART3

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_06_LPUART3_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_07_LPUART3_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_06_LPUART3_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_07_LPUART3_RX,
        0x10B0u);
#endif
#ifdef BSP_USING_LPUART4

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_00_LPUART4_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_01_LPUART4_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_B1_00_LPUART4_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_B1_01_LPUART4_RX,
        0x10B0u);
#endif
#ifdef BSP_USING_LPUART5

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_12_LPUART5_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_13_LPUART5_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_B1_12_LPUART5_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_B1_13_LPUART5_RX,
        0x10B0u);
#endif
#ifdef BSP_USING_LPUART6

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_02_LPUART6_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_03_LPUART6_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_02_LPUART6_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_03_LPUART6_RX,
        0x10B0u);
#endif
#ifdef BSP_USING_LPUART7

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_31_LPUART7_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_32_LPUART7_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_31_LPUART7_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_32_LPUART7_RX,
        0x10B0u);
#endif
#ifdef BSP_USING_LPUART8

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_10_LPUART8_TX,
        0U);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_11_LPUART8_RX,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_10_LPUART8_TX,
        0x10B0u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_11_LPUART8_RX,
        0x10B0u);
#endif
}
#endif /* BSP_USING_LPUART */

#ifdef BSP_USING_I2C
static void imxrt_i2c_pins_init(void)
{
#ifdef BSP_USING_I2C1
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL, /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
        1U);                             /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA, /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
        1U);                             /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL, /* GPIO_AD_B1_00 PAD functional properties : */
        0xD8B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                    Drive Strength Field: R0/6
                                                    Speed Field: medium(100MHz)
                                                    Open Drain Enable Field: Open Drain Enabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                    Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA, /* GPIO_AD_B1_01 PAD functional properties : */
        0xD8B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                    Drive Strength Field: R0/6
                                                    Speed Field: medium(100MHz)
                                                    Open Drain Enable Field: Open Drain Enabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                    Hyst. Enable Field: Hysteresis Disabled */
#endif

